{"data":{"site":{"siteMetadata":{"title":"sql-in-js","author":"Rick Bergfalk"}},"markdownRemark":{"id":"3c283854-188c-5cd0-82dc-53eb7c347d15","excerpt":"What is it about the Business Intelligence that drives people (including myself) to find a universal one-size-fits-all solution? Is it because we’re tired of…","html":"<p>What is it about the Business Intelligence that drives people (including myself) to find a universal one-size-fits-all solution? Is it because we’re tired of handling the endless onslaught of business requests? Is it because report writing eventually becomes extremely tedious? Is it because we start to feel we have a better understanding of business reporting requirements than the ones that write up the requirements?</p>\n<p>Several months ago I decided to jump in and build that thing that’s been nagging my brain for several years. It was a dashboard/database/web-app for reporting Key Performance Indicators (KPIs) in a nice way. The design in my head was simple. It was responsive. Flexible.</p>\n<p>I doodled little diagrams. Mocked out the data structures. Started building things in Node.js. Things eventually got serious, and I whipped up a very limited prototype.</p>\n<p>Unfortunately, as I played around with the result I started to ponder the usefulness of this tool.</p>\n<p>Since all the KPIs were displayed in the same format, I began to find myself distracted by the labels and numbers, looking at the collection of sparklines. In a way the graphics were doing what they were supposed to be doing, giving me quick little insights to the trend of data. But the information I was looking at as a whole didn’t seem very useful.</p>\n<p>The results felt empty. I saw the numbers and their trends on the screen, but it <em>conveyed no meaning to me.</em></p>\n<p>And I don’t know if that is a fault of the tool or me not having a use for the tool. The data I loaded up wasn’t 100% KPI related - some of it was more operational data, which really doesn’t fit well with a KPI reporting format.</p>\n<p>I can’t get the idea out of my head. I can build a prototype but I ultimately have no use for it. I have no way of validating this concept.</p>","frontmatter":{"title":"Dashboard Holy Grail","date":"October 01, 2013","description":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/dashboard-holy-grail/","previous":null,"next":{"fields":{"slug":"/building-ready-set-sql/"},"frontmatter":{"title":"What I Learned Building Ready Set SQL"}}}}